
# با زدن cmd میاره درپنجره ویندوز گوشه سمت جپ دسکتاپ







# //////////

# دادن نشانی یک فایل به cmd که از طریق اون وارد بشیم

# cd adress

# مثال
# اولش شاید اینو بیاره بالا
C:\Users\محمد نامجو>


# cd که بزنی
C:\Users\محمد نامجو>cd C:\Users\محمد نامجو\Desktop\New folder (2)


# حالا اینو میاره
C:\Users\محمد نامجو\Desktop\New folder (2)>


# که با راست کلیک در اون فولدر powershell  را میاره
# ///////



# حالا زدن رفتن در پایتون در cmd
# که یاا شناسایی شدهه
C:\Users\محمد نامجو\Desktop\New folder (2)> python

# میره توی یه ورژن پایتون


# برای خروج از اون برنامه
>>> exit()

C:\Users\محمد نامجو\Desktop\New folder (2)>

# //////////////////////
# cd
cd desctop
# میره توی دسکتاپ .
# پس cd میره توی جایی که گفتیم

# رفتن به یک فولدر جلو
cd

# رفتن یه فولدر عقب
# بازگشت برگشت
cd..

# /////
رفتن به یک درایو دیگر
F:
باید برگردی اول به c


# //////////
mkdir newfolder
# ایجاد کردن یک نیوفولدر از طریق cmd
# بهش میگن دایرکتوری


# ///////


# /////////////
dir
دیدن فایل ها فولدر های موجود

# /////







