
-- sql
-- //////
-- پرسشهای پاسخ داده نشده

    -- چگونه از کوئری هایی که اوردیم جدول بسازیم و در جایی ذخیره کنه
-- هی فارین کی بسایم و پرایمر کی باسزیم از اونا
-- چگونه دیتا بیس های استفاده شده را بالا بیاریم در پی اچ پی ادمین


-- //////
-- نمونه ها بر روی دیتا بیس AdventureWorks2019 است برخی
-- منبع
-- https://www.mongard.ir/courses/sql-course/episode/66/sql-primary-key/
-- ///////
-- دسسترسی داشتن به ددیتابیس
-- خواندن جدول ها . کواری
select * from emsha
-- میگه همه ستون ها *
-- از جدول امسها


-- حالا این میاد تعین میکنه کدوم ستون را
-- محدود کردن جدول ها
select esmet_chie from emsha

-- این میاد همه ستون ها را از اون جدول را میاره
-- فقط مینویسیم که همه ستون ها
select FOOD.*  from FOOD


-- ////
-- دسترسی به ستون و فقط ستونی که یه چیز خاص داشته باشه
-- یعنی فیلتر کردن خود ستون ها
-- محدود کردن ستون ها

select * from emsha where esmet_chie='mamad'
-- //////
-- این کد همه ی سطر و ستون از فایل پرسن جدول پرسن را میاره 
-- بعد جاهایی  را فیلتر میکنه و میاره که یه سطر  تایپ با ای ام باشه و سطر دیگر با صفر 
select *
from Person.Person 
WHERE PersonType = 'EM'
		AND 
		EmailPromotion ='0'
/*select *
from Sales.SalesPerson
*/
-- ////////
-- این کد فقط دو تا ستون را میاره  از اون فایل
SELECT SalesPersonID,
SubTotal
FROM Sales.SalesOrderHeader

-- /////
-- این کد میاد طبق گروه SalesPersonID 
-- جمع میزنه همه عناصر را که مشترک هستند در اون اسم 
SELECT SalesPersonID,   
sum(SubTotal) as gamee    -- این عملیات را در اون سطر که ما میگیم اجرا میکنه
FROM Sales.SalesOrderHeader   --این اسم فایل است
Group by SalesPersonID   -- این اون سطری که روش عملیات انجام میشه


-- ////////

--این کد میومد مرتب میکرد طبق ای دی پرسن ها
SELECT SalesPersonID,SalesOrderID
FROM Sales.SalesOrderHeader


-- ولی ما میخوایم بشماره که چند تا از هر ای دی بوده اند
-- و جمعشون را هم مثل قبلی بهمون بده

SELECT SalesPersonID,
count(SalesOrderID) as tedad,
sum(SalesPersonID) as gamee
FROM Sales.SalesOrderHeader
group by (SalesPersonID)

-- ////////
-- سینتکس کلی اینه
SELECT SalesPersonID,     -- اسم سطر های انتخابی را با کاما جدا میکنه
sum(SubTotal) as gamee    -- این عملیات را در اون سطر که ما میگیم اجرا میکنه
--سطر بالا را نمیاد یه بار بیاره و سپس عملیات را بزنه بلکه یه ضرب میزنه بیرون
FROM Sales.SalesOrderHeader   --این اسم فایل است
Group by SalesPersonID   -- این اون سطری که روش عملیات انجام میشه


-- //////////
-- کامنت کردن یه کد که بر روی دیتا بیس هستش
/*select *
from Sales.SalesPerson
*/
-- ////////
-- وارد کردن دیتا درون جدول های ساخته شده
-- راست کلیک کن درون جدوله و سپس گزینه
edit top 200 rows
-- را بزن

-- ////////
-- حذف یک سطر از یک جدول درون دیتا بیس
-- نخست باید در دیتا بیس یک کوری بنویسی
DELETE FROM PersonFOOD
--     # اگر این را بنویسی میاد همه را حذف میکنه
--        همه رکورد ها تا اینجا حذف میشه و فقط فیلد جدول میمونه
where FoodID = 6
-- # پس میایم ور میزنیم و میگیم که کدوم را حذف کنه

-- حالا اجرا روی دو تا یعنی دو تا سطر را حذف کنه
DELETE FROM FOOD
where FoodID = 7 and FoodID = 6
-- ////////
-- /////
-- اشتراک و اجتماع دو جدول


-- ////////
primary key - foreign key

-- شریط کلید اصلی:
--  منحصر است . فقط یه دونه است برای یک نفر
-- از کلید نان بیزینس استفاده کن که پس از تغیر دیگه اونرا عوض نکنی هی
-- نمیتونه خالی باشه . نال باشه






-- ///////////
-- قوانین نرمال سازی

-- برای بهینه کردن نرمال سازی میکنیم - برای رد افزونگی که یک داده در چند محل نباشه - برای سادگی- نه در سطر نه در ستون تکرار نباشه -تکرار نباید باشه    -
-- -1- ستون مرتبط تکراری نباشه - دوره ها1
--  -2- ۲- تمام ستون ها به کلید اصلی وابسته باشد - فیلد ها به همه کلید اصلی وابسته نه به تعدادیشون - به همه کلید های اصلی2
-- -3- ۳- فیلد ها به غیر کلید اصلی وابسته نباشه - تمام فیلد ها وابستگی کامل فقط به کلید اصلی - فقط به کلید اصلی3


-- توصیف و مثال :
--از دو :
-- یعنی نمیشه دوتا فیلد دو تا کلید جدا داشته باشه که هر کدوم وابسته به یکیشون باشه
-- از دو . نمیشه یه فیلد به یک کلید وابسته نباشد .
-- نمیشه یه فیلد به یک کلید وابسته نباشه و به یک کلید جدا وابسته باشد


-- از سه
-- . فقط به کلید اصلی نه به غیر کلید اصلی ها

--
--
--
-- ////////////////////
-- رابطه ها
-- یک به یک
-- هر رکورد در یه جدول یه رکورد در یک جدول دیگه داره
-- یه به چند
-- هر رکورد چند تا رکورد داره

-- چند به چند
-- چندتارکورد چندتا رکورد دارن


-- ////
-- این میاد همه ستون ها را از اون دیتا بیس را میاره
-- فقط مینویسیم که همه ستون ها
select FOOD.*  from FOOD
-- ///////
-- اشتراک گیری و اجتماع گیری بین جداول
-- حد وسطشون یعنی اشتراک را فقط میگیره
-- اشتراکات از سه تا جدوله که دوتا شو نشون میده هر بار
-- یعنی میگه اونهایی که در جدول فود هستند و همون فیلد را در جدول پرسن فود دارن
-- فقط همون ها را بده

inner join
SELECT FOOD.* , PersonFOOD.* from FOOD inner join PersonFOOD
--
on FOOD.FoodID = PersonFOOD.FoodID
--     اینجا شرط را میزاره در جایی که  این دو تا ای دیشون یکی باشه
-- یعنی باید اشتراک داشته باشند. که یعنی فارین کی باشد

-- /////////
left join
--     نا مشترک را میاره
-- - نا مشترکات چپی
-- میاد نا مشترک را نشون میده ولی جلوش
--                             NULL میزنه
--                              در کوئری
-- مثلا میاد غذا هایی که سفارش گرفته شده اند را نشون میده و غذا هایی که سفارش گرفته نشده اند را با نال نشون میده
SELECT FOOD.* , PersonFOOD.* from FOOD left join PersonFOOD
on FOOD.FoodID = PersonFOOD.FoodID

-- حال نمایش فقط نا مشترک ها - نا مشترکات چپی
WHERE PersonFOOD.FoodID is NULL
-- میاد فقط اون نا مشترک را نشون میده

-- //////
-- نامشترک های راستی
-- مشتری ها یی که خرید نکردن

select PersonFOOD.* , PERSON.* FROM PersonFOOD right join PERSON
ON PersonFOOD.PersonID= PERSON.PersonID







-- این میاد فقط نا مشترک ها را میاره
select PersonFOOD.* , PERSON.* FROM PersonFOOD right join PERSON
ON PersonFOOD.PersonID= PERSON.PersonID
WHERE PersonFOOD.OrderID is  Null
-- جالبه که در شرط میاد میگه از اون جدول ای که فارین کی داره یعنی جدول بزرگتره اون ای دی که نامشترکه نال باشه
-- اینجا میتونی هر ای دی دیگه را هم بزنی چون اونا هم در جدول ا مشترک نال هستند
-- چون اردر ای دی را نداره اون جدوله
-- ولی خوب از اونجا که بقیه ستون ها را هم که نداره نال میشه میتونی اونا را هم بزنی


-- ما میتونیم در خود یه جدول هم بزنیم یعنی در مساوی خودشو بزنیم
-- این کد فرقش اینه که میاد
همه را
select PersonFOOD.* , PERSON.* FROM PersonFOOD right join PERSON
ON PERSON.PersonID= PERSON.PersonID
-- هرچند اینو خوب متوجه نشدم

-- //////
-- نامشترک ها و مشترک ها
--                                همه اونا که سفارش ندادن -  همه غذا هایی که سفارش دادن - را نال میکنه - و سپس همه اونا که سفارش دادن و سفارش و غذا هایی که سفارش داده شده ان را هم میاره
-- FUUL JOIN


-- نخست . اگر بدون پرایمر کی ها و جدول رابط بیایم فول جوین کنیم میاد رندوم با هم سطر نخست را با سطر نخست دومی منطبق میکنه و به همین ترتیب همه را
select FOOD.* , PERSON.* from FOOD full join PERSON
on FOOD.FoodID = PERSON.PersonID
-- این میاد همه جدول نخست را یک به یک با جدول دوم منطبق میکنه
-- اما اگر یه سطر در یک جدول بزرگتر بود چی؟

-- این میاد جوین میکنه همه ای دی های غذا را با همون ای دی از پرسن . چون پرسن ۴ و ۵ غذا سفارش ندادن پس میاد نال میده برای اونها ار
select FOOD.* , PersonFOOD.* from FOOD full join PersonFOOD
on  PersonFOOD.PersonID =FOOD.FoodID


--   حالا این میاد
-- اشتراک گیری میکنه همه را میاره
--  چون توی جدول پرسن فود ای ای دی ها را با اسم غذا ها نوشته نبود
--  از لحاظ قابل درک بودن و کاری که با جدول ها انجام شده این جدول بهترین حالته
--  این جدلو میگه کی چی سفارش نداده
--  و چه غذایی توسط هیچ کس سفارش داده نشده

select FOOD.* , Person.* from Person full join PersonFOOD
on  PersonFOOD.PersonID =Person.PersonID  full join FOOD
on PersonFOOD.FoodID = FOOD.FoodID
-- این فول جوین شده را میاره جوین میکنه
-- این اول به ترتیب اسم ها را نشون میداد

-- حالا این به ترتیبه یعنی اگر مینوشتیم
select FOOD.* ,PERSON.* from FOOD full join PersonFOOD
on PersonFOOD.FoodID = FOOD.FoodID full join PERSON
on PersonFOOD.PersonID = PERSON.PersonID
-- میومد اول غذا هارا نشون میداد
-- هرچند هر دو یه خروچی را دارن
--

-- این کد هم میاد اشتراکه نامشترک ها را میاره
select FOOD.* ,PERSON.* from FOOD full join PersonFOOD
on PersonFOOD.FoodID = FOOD.FoodID full join PERSON
on PersonFOOD.PersonID = PERSON.PersonID
where PersonFOOD.OrderID is NULL

-- یعنی غذاهایی که فقط غذا هایی که سفارش داده نشده اند و ادمهایی که غذا سفارش نداده اند
--دقیقا برعس اینرجوین است . اینر جوین اشتراکه مثبت ها است این اشتراک منفی ها و نداده ها است
-- ////


-- چگونه از کوئری هایی که اوردیم جدول بسازیم و در جایی ذخیره کنه
-- هی فارین کی بسایم و پرایمر کی باسزیم از اونا
-- چگونه دیتا بیس های استفاده شده را بالا بیاریم در پی اچ پی ادمین
