
import numpy
import numpy as np
# محاسبات ماترسی انجام میدیم
# ////////

# //////
# آرایه ی چی است؟
a=np.array(5)
a
# array(5)

# ///////////////
یه ارایه میسازه از ۰ تا ۱۵
a= np.arange(15)
a
# array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

# ////
# تبدیل یه ارایه به ماتریس سه در پنج

a.reshape(3,5)
# array([[ 0,  1,  2,  3,  4],
#        [ 5,  6,  7,  8,  9],
#        [10, 11, 12, 13, 14]])

# /////////




# /////////

# /////////

# /////////




# /////////




# /////////




# /////////




# /////////


# /////////

# /////////

# /////////
#  تقسیم به n بخش که لیست باشن و خودمون میخوایم
import numpy as np
listA = [11, 18, 19, 21, 29, 46]
splits = np.array_split(listA, 3)
print(splits)
# [array([11, 18]), array([19, 21]), array([29, 46])]
# اینجا ارایمون را به سه تا بخش تقسیم کرد  . سه تا دوتایی

for array in splits:
    print(list(array))

# [11, 18]
# [19, 21]
# [29, 46]


# //////////
# تبدیل یک لیست به یک لیست تودرتو
data_list = [0,1,2,3,4,5,6,7,8]
new_list = [data_list[i:i+3] for i in range(0, len(data_list), 3)]
# new_list = [ [0,1,2] , [3,4,5] , [6,7,8] ]

# یا
import numpy
new_list = numpy.array(data_list).reshape(-1, 3)

# ///////
# چیدن لیست های مختلف در یک لیست تودرتو
# شبیه زیپ
print(np.column_stack([ram,size,camera,product,Brand,Model,battery,price]))

# /////
# بررسی چند بعدی بودن نام پای
import numpy as np
myarray = np.array([[[2,4,4],[2,34,9]],[[12,3,4],[2,1,3]],[[2,2,2],[2,1,3]]])

print("Array Dimension = ",len(myarray.shape))
# Array Dimension =  3

# //////
# تعداد مقادیرشو دیدن
print((Y.shape))
# myarray.shape

# ////////////
# تغیر نوع از پانداس به نام پای
# در کار با یادگیری ماشین هم با نامپای کار میکنیم و برای تغیر ها و نمایش داده با پانداس
X=(my_data[['sex','height','weight']])
print(type(X))
# <class 'pandas.core.frame.DataFrame'>
X=(my_data[['sex','height','weight']]).values
print(type(X))
# <class 'numpy.ndarray'>

# ///////
# برش زدن آرایه
# این فقط یه ردیف را میده
print(X[0])
# [161  78]
# این کل ستون صفر را بهمون میده
print(X[:,0])
# [161 178 178 167 165 170 170 167 175 179 164 173 156 175 167 169 176 178
#  176 179]


# حالا چطور دوتا ستون را بگیره؟
print(X[:, [0, 9]])
# [[161  78]
#  [178  80]
#  [178  86]
#  [167  59]
#  [165  86]

# یا اینکه بریزه توی دوتا متغیر
x, y = data[:, 1], data[:, 9]
# /////


# اگر یه بعدی باشه
# فقط خودشو میزنی
print(Y)
# ['مرد' 'مرد' 'زن' 'زن' 'مرد' 'مرد' 'زن' 'مرد' 'زن' 'زن' 'زن' 'زن' 'زن']


# ////




















